app/controllers/answers_controller.rb

  def new
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question
    if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "answers" ("answer", "answer_giver", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"