app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(created_at: :desc)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC

  def show
    @question = Question.find(params[:id])
    @answers = Answer.where(question_id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 2]]

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("name", "summary", "asker", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "asker" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["asker", "Sue"], ["updated_at", "2016-06-14 18:23:09.067235"], ["id", 2]]

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]